UCB_CS61_lec36.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第三十六课 Splay Tree
#+PROPERTY: header-args:ipython :session 第三十六课 Splay Tree
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第三十六课 Splay Tree
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


* Splay trees
  #+BEGIN_QUOTE
  A splay tree is a type of _balanced binary search tree_, Binary Search Tree
  #+END_QUOTE
splaytree 并不是一颗一直保持 balanced 的二叉树，而是 in a long term, it will
more and more balance, 他是在演进（每一步 api 操作都会演进）的过程中不断把访问过
的 node 调整到根节点位置， _这样下次访问该 node 时，cost O(1)_.

Structurally, it is identical to an ordinary binary search tree; the only
difference is in the algorithms for finding, inserting, and deleting entries.

All splay tree operations run in O(log n) time _on_average_, where n is the
number of entries in the tree. Any single operation can take Theta(n) time in
the worst case. But any sequence of k splay tree operations, with the tree
initially empty and never exceeding n items, takes O(k log n) worst-case time.

论单个的 operation（API 里的那几个），splay tree 都只有线性时间 theta(n), 这并不
是很快，但是 splay tree 是一棵岁操作而优化的树，节点被访问的越多越靠近树根，而且
每一个 api 里的 operation都会做 rotation 操作，去重新 balance 这颗树。所以长久来
看一系列的操作平均复杂度是 O(log n),n是树的节点数量。

Although 2-3-4 trees make a stronger guarantee (_every_ operation on a 2-3-4
tree takes O(log n) time), splay trees have several advantages.  Splay trees
are simpler and easier to program.  Because of their simplicity, splay tree
insertions and deletions are typically faster in practice (sometimes by a
constant factor, sometimes asymptotically).  Find operations can be faster or
slower, depending on circumstances.

Splay trees are designed to give especially fast access to entries that have
been accessed recently, so they really excel in applications where a small
fraction of the entries are the targets of most of the find operations.

Splay trees have become the most widely used basic data structure invented in
the last 30 years, because they're the fastest type of balanced search tree for
many applications.

** Tree Rotations
rotation 是唯一一个可以使树的高度减一的操作。这给树的 rebalance 带来很好的启发。
#+NAME: anotherRotationInterpretation
#+BEGIN_EXAMPLE
                              +----+
                              | w  |
                              +----+--
                            -/        \---
                          -/             /\
                  +----+-/              /  \
                  | u  |               /    \
                  +/---+-             /      \
                 -/      \-          /---------
               -/          \-
             -/              X
            /\              / \
           /  \            /   \
          /    \          /     \
         /      \        /       \
        /---------      /----------

First, just forget the links, then rotate


                              +----+                                     +----+
                              | w  |                                     | u  |
                              +----+                                     +----+

                                         /\
                  +----+                /  \                                         +----+
                  | u  |               /    \                      X                 | w  |
                  + ---+              /      \                    / \                +----+
                                     /---------    ======>       /   \
                                                                /     \
                             X                                 /--------        /\              /\
            /\              / \                                                /  \            /  \
           /  \            /   \                                              /    \          /    \
          /    \          /     \                                            /      \        /      \
         /      \        /       \                                          /---------      /---------
        /---------      /----------

#+END_EXAMPLE


从上图可以得出：
- rotation(u, w) : u-l,w-r unchanged; u-r-old is w-l; u-r-new is w;
同理(从右往左看上图)：
- rotation(u, w) : w-r,u-l unchanged; w-l-old is u-r; w-l-new is u;


#+BEGIN_EXAMPLE
Like many types of balanced search         Y       <<tree rotation>>     X
trees, splay trees are kept balanced      / \        rotate left        / \
with the help of structural changes      X   ^      <------------      ^   Y
called _rotations_.  There are two      / \ /C\                       /A\ / \
types--a left rotation and a right     ^  ^         ------------>         ^  ^
rotation--and each is the other's     /A\/B\         rotate right        /B\/C\
reverse.  Suppose that X and Y are
binary tree nodes, and A, B, and C are subtrees.  A rotation transforms either
of the configurations illustrated above to the other.  Observe that the binary
search tree invariant is preserved:  keys in A are less than or equal to X;
keys in C are greater than or equal to Y; and keys in B are >= X and <= Y.
#+END_EXAMPLE

_Rotations are also used in AVL trees and red-black trees_, which are discussed
by Goodrich and Tamassia, but are not covered in this course.

树的 rotation:
- X 向右 rotation，就相当于拎着 X，这时候 Y 自动向下来到右边，右子树太重所以没拎
  动，来到 Y 这了。
- X 向左 rotation，。。。。。。X，。。。Y。。。。。。左边，左。。。。。。。。。，
  来到 Y 这了。

Unlike 2-3-4 trees, splay trees are not kept perfectly balanced, but they tend
to stay reasonably well-balanced most of the time, thereby averaging O(log n)
time per operation in the worst case (and sometimes achieving O(1) average
running time in special cases).
*** zig and zag
- zig step rotate to left;
- zag step rotate to right

|          | l of l        | l of r        | l      |
|          | r of r        | r of l        | r      |
| rotation | Parent,Me     | Me,parent     |  me    |
|          | zi(a)g zi(a)g | zi(a)g za(i)g | zi(a)g |

zi(a)g zi(a)g rule 的主要作用就是 balance the tree.
防止遇到，unbalanced tree

