UCB_CS61_lec36.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 19:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第三十六课 Splay Tree</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第三十六课 Splay Tree</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9e90eb5">1. Splay trees</a>
<ul>
<li><a href="#org14c5e52">1.1. Tree Rotations</a>
<ul>
<li><a href="#orga18a4ec">1.1.1. zig and zag</a></li>
<li><a href="#orgea8fac9">1.1.2. See up two(one) levels: G and P, every time</a></li>
</ul>
</li>
<li><a href="#org63c401b">1.2. Main api of Splay Tree</a>
<ul>
<li><a href="#org842c4ca">1.2.1. [1]  Entry find(Object k);</a></li>
<li><a href="#orga2fa11a">1.2.2. [2]  Entry min(); Entry max();</a></li>
<li><a href="#org3dbd111">1.2.3. [3]  Entry insert(Object k, Object v);</a></li>
<li><a href="#org2676e30">1.2.4. [4]  Entry remove(Object k);</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc066ca8">2. Postscript:  Babble about Splay Trees (not examinable, but good for you)</a></li>
</ul>
</div>
</div>


<div id="org9e90eb5" class="outline-2">
<h2 id="org9e90eb5"><span class="section-number-2">1</span> Splay trees</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
A splay tree is a type of <span class="underline">balanced binary search tree</span>, Binary Search Tree
</p>
</blockquote>
<p>
splaytree 并不是一颗一直保持 balanced 的二叉树，而是 in a long term, it will
more and more balance, 他是在演进（每一步 api 操作都会演进）的过程中不断把访问过的 node 调整到根节点位置， <span class="underline">这样下次访问该 node 时，cost O(1)</span>.
</p>

<p>
Structurally, it is identical to an ordinary binary search tree; the only
difference is in the algorithms for finding, inserting, and deleting entries.
</p>

<p>
All splay tree operations run in O(log n) time <span class="underline">on_average</span>, where n is the
number of entries in the tree. Any single operation can take Theta(n) time in
the worst case. But any sequence of k splay tree operations, with the tree
initially empty and never exceeding n items, takes O(k log n) worst-case time.
</p>

<p>
论单个的 operation（API 里的那几个），splay tree 都只有线性时间 theta(n), 这并不是很快，但是 splay tree 是一棵岁操作而优化的树，节点被访问的越多越靠近树根，而且每一个 api 里的 operation都会做 rotation 操作，去重新 balance 这颗树。所以长久来看一系列的操作平均复杂度是 O(log n),n是树的节点数量。
</p>

<p>
Although 2-3-4 trees make a stronger guarantee (_every_ operation on a 2-3-4
tree takes O(log n) time), splay trees have several advantages.  Splay trees
are simpler and easier to program.  Because of their simplicity, splay tree
insertions and deletions are typically faster in practice (sometimes by a
constant factor, sometimes asymptotically).  Find operations can be faster or
slower, depending on circumstances.
</p>

<p>
Splay trees are designed to give especially fast access to entries that have
been accessed recently, so they really excel in applications where a small
fraction of the entries are the targets of most of the find operations.
</p>

<p>
Splay trees have become the most widely used basic data structure invented in
the last 30 years, because they're the fastest type of balanced search tree for
many applications.
</p>
</div>

<div id="org14c5e52" class="outline-3">
<h3 id="org14c5e52"><span class="section-number-3">1.1</span> Tree Rotations</h3>
<div class="outline-text-3" id="text-1-1">
<p>
rotation 是唯一一个可以使树的高度减一的操作。这给树的 rebalance 带来很好的启发。
</p>
<pre class="example" id="anotherRotationInterpretation">
                              +----+
                              | w  |
                              +----+--
                            -/        \---
                          -/             /\
                  +----+-/              /  \
                  | u  |               /    \
                  +/---+-             /      \
                 -/      \-          /---------
               -/          \-
             -/              X
            /\              / \
           /  \            /   \
          /    \          /     \
         /      \        /       \
        /---------      /----------

First, just forget the links, then rotate


                              +----+                                     +----+
                              | w  |                                     | u  |
                              +----+                                     +----+

                                         /\
                  +----+                /  \                                         +----+
                  | u  |               /    \                      X                 | w  |
                  + ---+              /      \                    / \                +----+
                                     /---------    ======&gt;       /   \
                                                                /     \
                             X                                 /--------        /\              /\
            /\              / \                                                /  \            /  \
           /  \            /   \                                              /    \          /    \
          /    \          /     \                                            /      \        /      \
         /      \        /       \                                          /---------      /---------
        /---------      /----------

</pre>


<p>
从上图可以得出：
</p>
<ul class="org-ul">
<li>rotation(u, w) : u-l,w-r unchanged; u-r-old is w-l; u-r-new is w;</li>
</ul>
<p>
同理(从右往左看上图)：
</p>
<ul class="org-ul">
<li>rotation(u, w) : w-r,u-l unchanged; w-l-old is u-r; w-l-new is u;</li>
</ul>


<pre class="example">
Like many types of balanced search         Y       &lt;&lt;tree rotation&gt;&gt;     X
trees, splay trees are kept balanced      / \        rotate left        / \
with the help of structural changes      X   ^      &lt;------------      ^   Y
called _rotations_.  There are two      / \ /C\                       /A\ / \
types--a left rotation and a right     ^  ^         ------------&gt;         ^  ^
rotation--and each is the other's     /A\/B\         rotate right        /B\/C\
reverse.  Suppose that X and Y are
binary tree nodes, and A, B, and C are subtrees.  A rotation transforms either
of the configurations illustrated above to the other.  Observe that the binary
search tree invariant is preserved:  keys in A are less than or equal to X;
keys in C are greater than or equal to Y; and keys in B are &gt;= X and &lt;= Y.
</pre>

<p>
<span class="underline">Rotations are also used in AVL trees and red-black trees</span>, which are discussed
by Goodrich and Tamassia, but are not covered in this course.
</p>

<p>
树的 rotation:
</p>
<ul class="org-ul">
<li>X 向右 rotation，就相当于拎着 X，这时候 Y 自动向下来到右边，右子树太重所以没拎动，来到 Y 这了。</li>
<li>X 向左 rotation，。。。。。。X，。。。Y。。。。。。左边，左。。。。。。。。。，来到 Y 这了。</li>
</ul>

<p>
Unlike 2-3-4 trees, splay trees are not kept perfectly balanced, but they tend
to stay reasonably well-balanced most of the time, thereby averaging O(log n)
time per operation in the worst case (and sometimes achieving O(1) average
running time in special cases).
</p>
</div>
<div id="orga18a4ec" class="outline-4">
<h4 id="orga18a4ec"><span class="section-number-4">1.1.1</span> zig and zag</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>zig step rotate to left;</li>
<li>zag step rotate to right</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">l of l</td>
<td class="org-left">l of r</td>
<td class="org-left">l</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">r of r</td>
<td class="org-left">r of l</td>
<td class="org-left">r</td>
</tr>

<tr>
<td class="org-left">rotation</td>
<td class="org-left">Parent,Me</td>
<td class="org-left">Me,parent</td>
<td class="org-left">me</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">zi(a)g zi(a)g</td>
<td class="org-left">zi(a)g za(i)g</td>
<td class="org-left">zi(a)g</td>
</tr>
</tbody>
</table>

<p>
zi(a)g zi(a)g rule 的主要作用就是 balance the tree.
防止遇到，unbalanced tree
</p>
</div>
</div>
