UCB_CS61_lec36.org
*** See up two(one) levels: G and P, every time
1. 先看
   1. 首先记录自己是父亲的左 or 右孩子，eg l
   2. 再看父亲是祖父的左 or 右孩子,    eg r
2. 看完，按照 l r 找对应操作： 对应 zag zig, 对应 右转 左传
3. 开始转
   1. 先从以自己的父亲为跟节点的子树开始转，按照 zag zig 顺序，这里是 zag 右转;
   2. 再按照自己的祖父为根节点的子树开始转，按照 zag zig 顺序，这里是 zig 左转;
4. 自己来到新的位置,有了新的父亲和祖父，从 1 开始重复

采用层层递‘上’的策略：

每次向前看两代 Grandparent and parent, 确定自己是 lofl(rofr),lofr(rofl),l(r)然后，
rotation 2 times according to lr. 这样之后自己上升了两层，然后， 再向前看两代，
然后在 rotation, 又前进两层。。。。当父亲节点就是跟节点 root 时，就只要 rotation
一次即可。

 #+BEGIN_EXAMPLE
   +-------+
   V       |
 检视 ---> 旋转  ===> near root
 #+END_EXAMPLE

** Main api of Splay Tree
_所有的操作都和 BinarySearchTree 一样， 不一样的就是每种操作之后都要加上 Splay it to root._
*** [1]  Entry find(Object k);

The find() operation in a splay tree begins just like the find() operation in
an ordinary binary search tree:  we walk down the tree until we find the entry
with key k, or reach a dead end (a node from which the next logical step leads
to a null pointer).



However, a splay tree isn't finished its job.  Let X be the node where the
search ended, whether it contains the key k or not.  We _splay_ X up the tree
through a sequence of rotations, so that X becomes the root of the tree.  Why?
One reason is so that recently accessed entries are near the root of the tree,
and if we access the same few entries repeatedly, accesses will be very fast.
Another reason is because if X lies deeply down an unbalanced branch of the
tree, the splay operation will improve the balance along that branch.

When we splay a node to the root of the tree, there are three cases that
determine the rotations we use.

#+BEGIN_EXAMPLE
1.      X is the right child of a left      G               G               X
   child (or the left child of a right     / \             / \             / \
   child):  let P be the parent of X,     P   ^           X   ^           P   G
   and let G be the grandparent of X.    / \ /D\  ==>    / \ /D\  ==>    / \ / \
   We first rotate X and P left,        ^  X            P  ^            ^  ^ ^  ^
   and then rotate X and G right, as   /A\/ \          / \/C\          /A\/BVC\/D\
   illustrated at right.                  ^  ^        ^  ^
                                         /B\/C\      /A\/B\     Zig-Zag
   The mirror image of this case--
   where X is a left child and P is a right child--uses the same rotations in
   mirror image:  rotate X and P right, then X and G left.  Both the case
   illustrated above and its mirror image are called the "zig-zag" case.
#+END_EXAMPLE

#+BEGIN_EXAMPLE
2.      X is the left child of a left     G               P               X
   child (or the right child of a right  / \             / \             / \
   child):  the ORDER of the rotations  P   ^           X   G           ^   P
   is REVERSED from case 1.  We        / \ /D\  ==>    / \ / \    ==>  /A\ / \
   start with the grandparent,        X  ^            ^  ^ ^  ^            ^  G
   and rotate G and P right.         / \/C\          /A\/BVC\/D\          /B\/ \
   Then, we rotate P and X right.   ^  ^                                     ^  ^
                                   /A\/B\                       Zig-Zig     /C\/D\
   The mirror image of this case--
   where X and P are both right children--uses the same rotations in mirror image:
   rotate G and P left, then P and X left.  Both the case illustrated above and
   its mirror image are called the "zig-zig" case.

   We repeatedly apply zig-zag and zig-zig rotations to X; each pair of rotations
   raises X two levels higher in the tree.  Eventually, either X will reach the
   root (and we're done), or X will become the child of
   the root.  One more case handles the latter
   circumstance.
#+END_EXAMPLE

#+BEGIN_EXAMPLE
                                                              P             X
                                                             / \           / \
                                                            X   ^         ^   P
3.      X's parent P is the root:  we rotate X and P       / \ /C\  ==>  /A\ / \
   so that X becomes the root.  This is called the        ^  ^               ^  ^
   "zig" case.                                           /A\/B\     Zig     /B\/C\

Here's an example of "find(7)".  Note how the tree's balance improves.

    11                     11                      11                  [7]
   /  \                   /  \                    /  \                 / \
  1    12                1    12                [7]   12              1   11
 / \                    / \                     / \                  /\   / \
0   9                  0   9                   1   9                0 5   9  12
   / \                    / \                 / \ / \                / \ / \
  3   10  =zig-zig=>    [7]  10  =zig-zag=>  0  5 8  10   =zig=>    3  6 8  10
 / \                    / \                    / \                 / \
2   5                  5   8                  3   6               2   4
   / \                / \                    / \
  4  [7]             3   6                  2   4
     / \            / \
    6   8          2   4
#+END_EXAMPLE

#+BEGIN_EXAMPLE
By inspecting each of the three cases (zig-zig, zig-zag, and zig), you can
observe a few interesting facts.  _First_, in none of these three cases does the
depth of a subtree increase by more than
two.  Second, every time X takes two                       9
steps toward the root (zig-zig or zig-zag),               / \
every node in the subtree rooted at X moves              8   10
at least one step closer to the root.                   /                         <<unbalanced tree>>
As more and more nodes enter X's subtree,              7
more of them get pulled closer to the root.           /
                                                     6           1
A node that initially lies at depth d on            /           / \
the access path from the root to X moves           5           0   8
to a final depth no greater than 3 + d/2.         /               / \
In other words, all the nodes deep               4               6   9
down the search path have their                 /               / \   \
depths roughly halved.  This tendency          3  ==========>  4   7   10
of nodes on the access path to move           /     find(1)   / \
toward the root prevents a splay tree        2               2   5
from staying unbalanced for long            /                 \
(as the example at right illustrates).     1                   3
                                          /
                                         0
#+END_EXAMPLE

*** [2]  Entry min(); Entry max(); 

These methods begin by finding the entry with minimum or maximum key, just like
in an ordinary binary search tree.  Then, they splay the node containing the
minimum or maximum key to the root.

*** [3]  Entry insert(Object k, Object v);

insert() begins by inserting the new entry (k, v), just like in an ordinary
binary search tree.  Then, it splays the new node to the root.

