UCB_CS61_lec36.org
*** [4]  Entry remove(Object k);

An entry having key k is removed from the tree, just as with ordinary binary
search trees.  Recall that the node containing k is removed if it has zero or
one children.  If it has two children, the node with the next higher key is
removed instead.  In either case, let X be the node removed from the tree.
After X is removed, splay X's parent to the root.  Here's a sequence
illustrating the operation remove(2).

#+BEGIN_EXAMPLE
                      2             4               5
                     / \           / \             / \
                    1   7         1   7           4   7
                       / \   ==>     / \   ==>   /     \
                      5   8         5   8       1       8
                     /
                    4
#+END_EXAMPLE

In this example, the key 4 moves up to replace the key 2 at the root.  After
the node containing 4 is removed, its parent (containing 5) splays to the root.

If the key k is not in the tree, splay the node where the search ended to the
root, just like in a find() operation.

对于 remove() 当有一个 key 没有找到时，你仍需要返回一些东西,为什么呢？因为，当你
找的时候，也许他位于很深的位置，如果这次找你不做点什么，那么下次你再找同一个 key
的时候他仍然花费这么多时间，所以为了符合 splaytree 的核心特色（不断优化的树），
即便什么都找不到，你仍然要做 splay，仍然要继续 balance 这颗树。这时就 splay the
node last visited(where the search ended) to the root.

* Postscript:  Babble about Splay Trees (not examinable, but good for you)
It may improve your understanding to watch the splay tree animation at
http://www.ibr.cs.tu-bs.de/courses/ss98/audii/applets/BST/SplayTree-Example.html .

Splay trees can be rigorously shown to run in O(log n) average time per
operation, over any sequence of operations (assuming we start from an empty
tree), where n is the largest size the tree grows to.  However, the proof is
quite elaborate.  It relies on an interesting algorithm analysis technique
called _amortized_analysis_, which uses a _potential_function_ to account for
the time saved by operations that execute more quickly than expected.  This
"saved-up time" can later be spent on the rare operations that take longer than
O(log n) time to execute.  By proving that the potential function is never
negative (that is, our "bank account" full of saved-up time never goes into the
red), we prove that the operations take O(log n) time on average.

The proof is given in Goodrich & Tamassia Section 10.3.3 and in the brilliant
original paper in the Journal of the Association for Computing Machinery,
volume 32, number 3, pages 652-686, July 1985.  Unfortunately, there's not much
intuition for why the proof works.  You crunch the equations and the result
comes out.

In 2000, Danny Sleator and Robert Tarjan won the ACM Kanellakis Theory and
Practice Award for their papers on splay trees and amortized analysis.


#+BEGIN_EXAMPLE
Splay trees are used in Windows NT (in the virtual memory, networking, and file
system code), the gcc compiler and GNU C++ library, the sed string editor, Fore
Systems network routers, the most popular implementation of Unix malloc, Linux
loadable kernel modules, and in much other software.                          .
                                                                             .
                                                                            .
When do operations occur that take more than O(log n) time?                /
Consider inserting a long sequence of numbers in order:  1, 2, 3,         4
etc.  The splay tree will become a long chain of left children (as       /
illustrated at right).  Now, find(1) will take Theta(n) time.           3
However, each of the n insert() operations before the find took O(1)   /
time, so the average for this example is O(1) time per operation.     2
                                                                     /
                                                                    1
#+END_EXAMPLE

The fastest implementations of splay trees don't use the bottom-up splaying
strategy discussed here. Splay trees, like 2-3-4 trees, come in bottom-up and
top-down versions. Instead of doing one pass down the tree and another pass up,
top-down splay trees do just one pass down. This saves a constant factor in the
running time.

There is an interesting conjecture about splay trees called the _dynamic_
_optimality_conjecture_: that splay trees are as asymptotically fast on _any_
sequence of operations as _any_ other type of search tree with rotations. What
does this mean? Any sequence of splay tree operations takes amortized O(log n)
time per operation, but sometimes there are sequences of operations that can be
processed faster by a sufficiently smart data structure. One example is
accessing the same ten keys over and over again (which a splay tree can do in
amortized O(1) time per access). The dynamic optimality conjecture guesses that
if _any_ search tree can exploit the structure of a sequence of accesses to
achieve asymptotically faster running time, so can splay trees.

The conjecture has never been proven, but it's not clear whether it's been
disproven, either.

One special case that has been proven is that if you perform the find operation
on each key in a splay tree in order from the smallest key to the largest key,
the total time for all n operations is O(n), and not O(n log n) as you might
expect.
